app/controllers/singers_controller.rb

SELECT * FROM `singers`
---
  def index
    @singers = Singer.all

INSERT INTO `singers` (`name`, `updated_at`, `created_at`) VALUES('thisu is tarub', '2014-02-02 16:11:09', '2014-02-02 16:11:09')
---
  def create
    @singer = Singer.new(params[:singer])

    respond_to do |format|
      if @singer.save

DELETE FROM `singers` WHERE `id` = 32
---
  def destroy
    @singer.destroy