app/controllers/songs_controller.rb

SELECT * FROM `songs` WHERE (`songs`.`singer_id` IS NULL)
SELECT * FROM `singers` WHERE (`singers`.`id` = 32)
---
  def index
    @songs = Song.find_all_by_singer_id(params[:singer_id])
    @singer = Singer.find(params[:singer_id])

INSERT INTO `songs` (`audio_file_size`, `audio_file_name`, `created_at`, `audio_content_type`, `singer_id`, `updated_at`, `audio_updated_at`) VALUES(2141293, '01_-_Harbhajan_Mann___Shweta_Pandit_-_Sun_Mere_Chann_Mahia-_Mr-Jatt-CoM_.mp3', '2014-02-03 18:51:00', 'audio/mpeg', 32, '2014-02-03 18:51:00', '2014-02-03 18:51:00')
---
  def create
    @song = @singer.songs.build(params[:song])

    respond_to do |format|
      if @song.save

SELECT * FROM `songs` WHERE (`songs`.`id` = 10 AND (`songs`.singer_id = 32))
DELETE FROM `songs` WHERE `id` = 2
---
  def destroy
    @song = @singer.songs.find(params[:id])
    @song.destroy

SELECT * FROM `songs` WHERE (`songs`.`id` = 14)
---
  def audio_download
   @song = Song.find(params[:id])